console.log("number" + 3 + 3);
// так як "number" рядок, то буде намагатися далі перетворити числа на рядки
// і виконати конкатенацію строк
// "number" - рядок, 3 - перетвориться в рядок, відбудеться конкатенація "number3"
// далі друга 3 також перетвориться в рядок і відбудеться конкатенація "number33"

console.log(null + 3);
// null буде намагатися перетвориться в число 0, буде 0, далі операція додавання 0 + 3, в результаті число 3

console.log(5 && "qwerty");
// в результаті роботи логічного && в даному випадку (оба true) виведеться останнє true, тобто "qwerty"

console.log(+"40" + +"2" + "hillel");
// унарний + перед рядком "40" перетворить його на число 40, унарний + перед рядком "2" перетворить його на число 2,
// далі буде аріфметичне додавання 40 та 2 (число 42), далі перетворення 42 на рядок та конкатенація з "hillel",
// в результаті отримаємо рядок "42hillel"

console.log("10" - 5 === 6);
// у лівій частині відбудеться перетворення рядка "10" на число 10, далі аріфметична операція віднімання
// 10 - 5 = 5
// далі відбудеться порівняння значень і типів через === , і отримаємо false, число 5 не дорівнює числу 6

console.log(true + false);
// операція додавання, так як серед операндів нема рядка, то буде намагатися перетворити на число
// true перетвориться на число 1, false перетвориться на число 0,
// в результаті додавання отримаємо число 1

console.log("4px" - 3);
// операція віднімання, тому рядок "4px" буде намагатися перетворити на число, вийде NaN
// NaN - 3 отримуємо NaN

console.log("4" - 3);
// операція віднімання, тому рядок "4" намагається перетворити на число і отримуємо число 4
// далі віднімання двух чисел 4 - 3 отримуємо число 1

console.log("6" + 3 ** 0);
// по пріоритету операцій спочатку виконається возведение в степінь 3 ** 0 і це дорівнює числу 1
// далі так как "6" - рядок, то буде намагатися перетворити число 1 на рядок
// і відбудется конкатенація рядків "6" + "1" дорівнює "61"

console.log(12 / "6");
// оператор ділення буде намагатися перетворити рядок "6" на число, вийде число 6
// далі операція ділення 12 / 6  дорівнює числу 2

console.log("10" + (5 === 6));
// по пріоритету операцій виконається перша в дужках це порівняння значень і типів, отримуємо false
// далі так как "10" - рядок, то буде намагатися перетворити false на рядок, отримуємо "false"
// і потім відбудеться конкатенація рядка "10" та рядка "false", результат рядок "10false"

console.log(null == "");
// це порівняння по значенню, і null не дорівнює порожньому рядку, виведе false

console.log(3 ** (9 / 3));
// по пріоритету операцій спочатку виконається операція в дужках і дасть число 3
// далі возведення 3 в ступінь 3, результат число 27

console.log(!!"false" == !!"true");
// ліва частина - приводить значення !!"false" до булевого типу з подвійним запереченням і отримуємо  true
// права частина - приводить значення !!"true" до булевого типу з подвійним запереченням і отримуємо  true
// далі порівнюємо за значенням true == true, відповідь true

console.log(0 || ("0" && 1));
// ліва частина дає false, тому дивиться праву частину що вона вертає
// права частина: "0" - це рядок, true, 1 - це число, true
// тому вираз 0 || ("0" && 1) повертає останнє true це число 1

console.log((+null == false) < 1);
// перша операція в дужках, унарний + перед null намагається перетворити його на число і виходить 0
// далі порівнюємо по значенню 0 == false, це true
// далі порівнюємо true < 1, при порівнянні обидві частини приводяться до чисел, порівнюємо 1 < 1, це false

console.log((false && true) || true);
// операція логічне або
// перевіряємо ліву частину false && true, вираз поверне перше false, в даному випадку це false
// далі перевіряємо false || true, поверне перше true
// результат (false && true) || true) - true

console.log(false && (false || true));
// перевіряємо вираз логічне і
// ліва частина false, тому весь вираз одразу поверне false

console.log((+null == false) < 1 ** 5);
// перша виконується операція в дужках (+null == false)
// унарний + приводить null до числа і отримуємо число 0
// порівнюємо 0 == false, це true
// виконуємо возведення в ступінь числа 1 ** 5, отримуємо число 1
// порівнюємо true < 1, true перетворюється в число 1, 1 < 1, це false
